BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega1280.PIC
        <edc:SFRDef edc:_addr="0x7C" edc:access="nnnnnnnn" edc:cname="ADMUX" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MUX" edc:desc="Analog Channel and Gain Selection Bits" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="ADC0" edc:desc="ADC Single Ended Input pin 0" edc:when="(field &amp; 0x1F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ADC1" edc:desc="ADC Single Ended Input pin 1" edc:when="(field &amp; 0x1F) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ADC2" edc:desc="ADC Single Ended Input pin 2" edc:when="(field &amp; 0x1F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ADC3" edc:desc="ADC Single Ended Input pin 3" edc:when="(field &amp; 0x1F) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ADC4" edc:desc="ADC Single Ended Input pin 4" edc:when="(field &amp; 0x1F) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ADC5" edc:desc="ADC Single Ended Input pin 5" edc:when="(field &amp; 0x1F) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ADC6" edc:desc="ADC Single Ended Input pin 6" edc:when="(field &amp; 0x1F) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="ADC7" edc:desc="ADC Single Ended Input pin 7" edc:when="(field &amp; 0x1F) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC0_10X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 0 10x Gain" edc:when="(field &amp; 0x1F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC0_10X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 0 10x Gain" edc:when="(field &amp; 0x1F) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC0_200x" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 0 200x Gain" edc:when="(field &amp; 0x1F) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC0_200X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 0 200x Gain" edc:when="(field &amp; 0x1F) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_10X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 10x Gain" edc:when="(field &amp; 0x1F) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_10X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 10x Gain" edc:when="(field &amp; 0x1F) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_200X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 200x Gain" edc:when="(field &amp; 0x1F) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_200X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 200x Gain" edc:when="(field &amp; 0x1F) == 0x0F"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="ADC4_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 4 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x14"/>
                <edc:SFRFieldSemantic edc:cname="ADC5_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 5 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x15"/>
                <edc:SFRFieldSemantic edc:cname="ADC6_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 6 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x16"/>
                <edc:SFRFieldSemantic edc:cname="ADC7_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 7 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x17"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x18"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x19"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1A"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1B"/>
                <edc:SFRFieldSemantic edc:cname="ADC4_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 4 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1C"/>
                <edc:SFRFieldSemantic edc:cname="ADC5_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 5 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1D"/>
                <edc:SFRFieldSemantic edc:cname="ADC_VBG" edc:desc="Internal Reference (VBG)" edc:when="(field &amp; 0x1F) == 0x1E"/>
                <edc:SFRFieldSemantic edc:cname="ADC_GND" edc:desc="0V (GND)" edc:when="(field &amp; 0x1F) == 0x1F"/>
                <edc:SFRFieldSemantic edc:cname="ADC8" edc:desc="ADC Single Ended Input pin 8" edc:when="(field &amp; 0x1F) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="ADC9" edc:desc="ADC Single Ended Input pin 9" edc:when="(field &amp; 0x1F) == 0x21"/>
                <edc:SFRFieldSemantic edc:cname="ADC10" edc:desc="ADC Single Ended Input pin 10" edc:when="(field &amp; 0x1F) == 0x22"/>
                <edc:SFRFieldSemantic edc:cname="ADC11" edc:desc="ADC Single Ended Input pin 11" edc:when="(field &amp; 0x1F) == 0x23"/>
                <edc:SFRFieldSemantic edc:cname="ADC12" edc:desc="ADC Single Ended Input pin 12" edc:when="(field &amp; 0x1F) == 0x24"/>
                <edc:SFRFieldSemantic edc:cname="ADC13" edc:desc="ADC Single Ended Input pin 13" edc:when="(field &amp; 0x1F) == 0x25"/>
                <edc:SFRFieldSemantic edc:cname="ADC14" edc:desc="ADC Single Ended Input pin 14" edc:when="(field &amp; 0x1F) == 0x26"/>
                <edc:SFRFieldSemantic edc:cname="ADC15" edc:desc="ADC Single Ended Input pin 15" edc:when="(field &amp; 0x1F) == 0x27"/>
                <edc:SFRFieldSemantic edc:cname="ADC8_ADC8_10X" edc:desc="ADC Differential Inputs Postive pin 8 Negative pin 8 10x Gain" edc:when="(field &amp; 0x1F) == 0x28"/>
                <edc:SFRFieldSemantic edc:cname="ADC9_ADC8_10X" edc:desc="ADC Differential Inputs Postive pin 9 Negative pin 8 10x Gain" edc:when="(field &amp; 0x1F) == 0x29"/>
                <edc:SFRFieldSemantic edc:cname="ADC8_ADC8_200x" edc:desc="ADC Differential Inputs Postive pin 8 Negative pin 8 200x Gain" edc:when="(field &amp; 0x1F) == 0x2A"/>
                <edc:SFRFieldSemantic edc:cname="ADC9_ADC8_200X" edc:desc="ADC Differential Inputs Postive pin 9 Negative pin 8 200x Gain" edc:when="(field &amp; 0x1F) == 0x2B"/>
                <edc:SFRFieldSemantic edc:cname="ADC10_ADC10_10X" edc:desc="ADC Differential Inputs Postive pin 10 Negative pin 10 10x Gain" edc:when="(field &amp; 0x1F) == 0x2C"/>
                <edc:SFRFieldSemantic edc:cname="ADC11_ADC10_10X" edc:desc="ADC Differential Inputs Postive pin 11 Negative pin 10 10x Gain" edc:when="(field &amp; 0x1F) == 0x2D"/>
                <edc:SFRFieldSemantic edc:cname="ADC10_ADC10_200X" edc:desc="ADC Differential Inputs Postive pin 10 Negative pin 10 200x Gain" edc:when="(field &amp; 0x1F) == 0x2E"/>
                <edc:SFRFieldSemantic edc:cname="ADC11_ADC10_200X" edc:desc="ADC Differential Inputs Postive pin 11 Negative pin 10 200x Gain" edc:when="(field &amp; 0x1F) == 0x2F"/>
                <edc:SFRFieldSemantic edc:cname="ADC8_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 8 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x30"/>
                <edc:SFRFieldSemantic edc:cname="ADC9_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 9 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x31"/>
                <edc:SFRFieldSemantic edc:cname="ADC10_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 10 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x32"/>
                <edc:SFRFieldSemantic edc:cname="ADC11_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 11 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x33"/>
                <edc:SFRFieldSemantic edc:cname="ADC12_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 12 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x34"/>
                <edc:SFRFieldSemantic edc:cname="ADC13_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 13 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x35"/>
                <edc:SFRFieldSemantic edc:cname="ADC14_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 14 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x36"/>
                <edc:SFRFieldSemantic edc:cname="ADC15_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 15 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x37"/>
                <edc:SFRFieldSemantic edc:cname="ADC8_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 8 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x38"/>
                <edc:SFRFieldSemantic edc:cname="ADC9_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 9 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x39"/>
                <edc:SFRFieldSemantic edc:cname="ADC10_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 10 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x3A"/>
                <edc:SFRFieldSemantic edc:cname="ADC11_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 11 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x3B"/>
                <edc:SFRFieldSemantic edc:cname="ADC12_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 12 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x3C"/>
                <edc:SFRFieldSemantic edc:cname="ADC13_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 13 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x3D"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADLAR" edc:desc="Left Adjust Result" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REFS" edc:desc="Reference Selection Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="AREF, Internal Vref turned off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="AVCC with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Internal 1.1V Voltage Reference with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Internal 2.56V Voltage Reference with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7D" edc:access="nnnnnnnn" edc:cname="DIDR2" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC8D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC10D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC11D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC12D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC13D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC14D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC15D" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7E" edc:access="nnnnnnnn" edc:cname="DIDR0" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC0D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC1D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC2D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC3D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC4D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC5D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC6D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC7D" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7F" edc:access="------nn" edc:cname="DIDR1" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AIN0D" edc:desc="AIN0 Digital Input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIN1D" edc:desc="AIN1 Digital Input Disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
